/*:
## 陣列字面值

 你已經使用了字面值，直接在程式碼中製作了字串、數值和布林值。你也可以使用「陣列字面值」直接在程式碼中建立陣列。

 陣列字面值是項目的列表 (以逗號分隔)，所有項目都包含在方括號中：
 */
let devices = ["iPhone", "iPad", "iPod", "iMac"]
/*:
 將游標移至結果側邊欄中的列表上，並且使用圓形的「Show Result」按鈕來新增內嵌至 Playground 的陣列。在內嵌顯示區中，陣列中的每個項目都有從零開始的數值，就像這樣：

`0 "iPhone"`\
`1 "iPad"`\
`2 "iPod"`\
`3 "iMac"`

 - callout(實驗：): 變更上述 `devices` 陣列字面值中項目的順序或數目。請留意，結果檢視器中的項目順序一律與字面值中輸入的項目順序相符。
 */
/*:
 - callout(實驗：): 在下方建立名為 `highScores` 的新常數，並將包含十個數值的列表指定給它。
 */
// Define highScores array below

/*:
 前往下一頁以了解這些數值的用途。
 
[上一頁](@previous)  |  第 2 頁，共 18 頁  |  [下一頁：索引](@next)
 */