/*:
## 寵物問題回顧
在你做出所有更新之後，Playground 應如下所示：
 */
// Number Of Dogs
6

// Number Of Cats
5

// Number Of Turtles
2

// Number Of Hamsters
1

// Total Number Of Animals
6 + 5 + 2 + 1

// Total Number Of Mammals
6 + 5 + 1
/*:
此 Playground 絕對可以幫助你解決朋友的問題。你記錄了每種動物的數目、動物總數，以及哺乳動物總數。

但做完實驗之後，你可能已經注意到過程很容易出錯。你必須在多處變更數字。而且如果你忘記更新各處的數字，總數就會不正確。

你也必須記得每種動物所記錄的數字。若沒有該註解可識別每個數字的話，就很難得出正確紀錄。

當撰寫程式碼時，最實用的做法就是命名。與其使用一直重複代表相同事物的數字，你可以給予該事物一個名稱，然後在程式碼中的必要處使用該名稱，而非使用數字。

接下來，你將了解要如何命名。

[上一頁](@previous)  |  第 3 頁，共 14 頁  |  [下一頁：命名事物](@next)
 */