/*:
## 程式設計師語言
開發 app 不只是弄清楚在 Xcode 中輸入什麼。同時也要和其他程式設計師合作，討論如何解決問題並互相解釋。因此學習程式設計師使用的術語是很重要的。

在整個課程中，你將學習如何編寫程式碼和建構 app，也將學習與其他開發者討論程式碼時必須用到的詞彙。

在此 Playground 中，你已經學到「常數」和「識別碼」這兩個詞彙。請繼續讀下去，了解一些其他詞彙。

從第 1 個 Playground 開始，你寫了像是 `6 + 2` (這是「表示式」的範例) 這類的程式碼。電腦會評估表示式以產生值。

表示式本身便能提供一些資訊。在此 Playground 中，你新增了「語句」的值。語句更像是指示或動作 (而且通常包含表示式)，往往非正式稱為「程式碼行」。
 */
let numberOfDogs = 101
/*:
當你在 Swift 中定義常數時，此動作稱為「宣告」常數。因此，上面的語句稱為「宣告」。其下達給電腦的指示是「宣告名稱 `numberOfDogs` 有值 `101`」。

`let` 這個字是「關鍵字」的範例。每個關鍵字在 Swift 中都有特殊的意義，無法作為名稱。`let` 是用來宣告常數的關鍵字。經過一段時間的累積，你會學到更多 Swift 關鍵字。

語句中 `= 101` 的部分是你將值「指定」常數值的位置。這稱為「賦值」，等號 `=` 稱為「賦值運算子」。

 - callout(附註：): 不必擔心要記住每一個新詞彙，可能會多到難以記住！後續的課程都會用到這些詞彙，如果你需要複習一下，隨時都可以在「詞彙表」找到它們。

[上一頁](@previous)  |  第 8 頁，共 14 頁  |  [下一頁：總結](@next)
 */