/*:
## 常數和變數

 在程式設計時，一律參照同一個值的名稱，以及其值會隨著時間改變的名稱，兩者之間有一個重要的差異。
 
 在現實世界中命名亦是如此，但大家總是未注意到此差異。
 
#### 常數

 例如，想一想「你的生日」。你的生日永遠不變。無論你有多年輕，又或者變得多老，這個日期始終不變。即使數百年後，當大家讀到你如何用絕妙的 app 改變世界時，你的生日仍保持不變。
 
 你的生日是個常數。該值在你出生時設定一次，此後就不再改變。在程式碼中，你要將 `birthdate` 設為常數。
 
 
#### 變數

 大家日常使用的許多名稱隨著時間的進展可能具有不同的值。
 
 例如，想一想「你最喜歡的襯衫」或其他衣服。你兩歲時最喜歡的，可能是帶有恐龍或獨角獸圖案的襯衫。隨著年齡增長，無論尺寸還是款式，這件襯衫不再合適，現在你最喜歡的是另一件襯衫。未來，你或許會有許多不同件最喜歡的襯衫。你仍有「最喜歡的襯衫」的名稱或想法，但你實際所指的襯衫會持續隨著時間而改變。

 在程式碼中，`favoriteShirt` 稱為變數。

#### 兩者皆是
 在大多數類型的團隊運動中，你總能同時看到常數和變數這兩種概念。這裡有「主隊」和「客隊」的概念。在你的學校，主隊始終不變。對你的學校而言，這是常數。「客隊」在名稱或概念上沒有變化，只是每場比賽的實際隊伍是會變化的。客隊是變數。

 - callout(實驗：): 想一想現實生活中的常數和變數。從下面的列表開始進行：
   - 你的出生地
   - 你的居住地
   - 你的年齡
   - 你最喜歡的電影
   - 你腳的大小
   - 美國的第一任總統是誰

[上一頁](@previous)  |  第 2 頁，共 13 頁  |  [下一頁：宣告變數](@next)
 */