/*:
## 閱讀詳細的手冊

 彈出框和 Quick Help 檢閱器都是從相同的來源取得其資訊，即是該特定 API 提供的說明文件。
 
 你可以使用彈出框或 Quick Help 檢閱器底部的連結來存取完整的說明文件：

 ![說明文件連結](LinkToDocs.png)

 你也可以使用選單的「Window」>「Developer Documentation」直接存取說明文件。這會另外開啟一個含說明文件檢視器的視窗。

 - callout(練習：): 依照上面的指示開啟說明文件檢視器，並使用該視窗頂部的搜尋列來搜尋 `String`。查看一些關於 `String` 類型的說明文件。

 搜尋結果應如下所示，請選取第一項來查看 `String` API 的說明文件：

 ![String 的搜尋結果](StringSearch.png)

 - callout(附註：): 說明文件涵蓋了「所有內容」，這可能會使它看起來非常複雜。你並不需要閱讀、理解或記住全部內容，就像你不會要閱讀、理解和記住維基百科全部內容一樣。它只是在你需要時，為你提供所需的資訊。

 接下來，我們來了解在文件中最常看到、用於宣告類型的兩種方式。

[上一頁](@previous)  |  第 11 頁，共 17 頁  |  [下一頁：類別與結構](@next)
 */