/*:
## 練習：圓圈

 將圓的直徑 (圓周任一兩點的最大距離) 乘以 **ᴨ** (pi)，可以得出圓周 (圓的周長)。
 
 pi 的近似值為：
 */
let pi = 3.14159265359
//:  - callout(練習：): 編寫一個程式來計算直徑為 2 的圓周長。建立常數來保留直徑。這個常數應為何種類型？

/*:
  _Copyright © 2021 Apple Inc._

 茲免費授權任何人均可取得本軟體及相關文件之副本 (以下稱「本軟體」)，可無限制交易本軟體 (包括但不限於使用、複製、修改、合併、發行、散佈、轉授權及 (或) 銷售本軟體之副本)，並允許接受本軟體之個人在下列條件下從事此類行為：

 本軟體之所有副本或重要部分均須載明上述版權聲明與本許可聲明。

 本軟體乃依「現況」提供，不含任何明示或默示擔保，包括但不限於適售性、符合特定目的及未侵權之瑕疵擔保。在任何情況下，對於因本軟體而起，或是與本軟體、使用本軟體或交易本軟體有關之任何索賠、損害或其他賠償責任，無論是出於合約之訴、侵權行為或其他形式的索賠，作者或著作權所有人概不負責。

[上一頁](@previous)  |  第 13 頁，共 13 頁
 */