/*:
## 實例

 你已經在 Swift 中使用了多種類型，例如 `String`。個別 `String` 值 (例如「hello」) 稱為該類型的「實例」。
 
- `String` 是類型
- `"hello"` 是 `String` 的「實例」。
 
你現在已經建立了類型 `Int` 和 `String` 的實例。事實上，程式中建立的每個值都是其類型的實例。
 
常數 `hello` 和 `aDifferentHello` 是恰巧使用相同資料的兩個 `String` 實例。
 */
let hello = "hello"
let aDifferentHello = "hello"
/*:
你已經知道，實例的類型決定它所包含的資料類型，以及其在程式碼中的使用方式。
 
你還對實例執行了一些操作：將字串加在一起、計算數字等。但是，實例的作用比這些操作更強大。
 
在此 Playground 中，你將學習更多建立和使用實例的知識，包括存取其值和行為。
 
接下來，我們來了解幾個建立實例的新方式。

[上一頁](@previous)  |  第 2 頁，共 17 頁  |  [下一頁：建立實例](@next)
 */