/*:
## 你的選擇你作主

 對於拼字檢查工具而言，「My deer Uncle Joe came to visit」這個句子非常好。沒有拼錯的字。
 
 但是，你的叔叔 Joe 可能並沒有四條腿和鹿角。你或許是指「My『dear』Uncle Joe…」

 拼字檢查工具會提供給你拼法正確但未表達你意思的句子同樣地，Fix-it 可以修復程式碼中的錯誤，但是此修復可能並不是你想要的。

 例如，在上一頁，你使用 Fix-it 將常數改成變數。
 
 你已經知道，只有在值明確需要隨時間而變化時，才應該使用變數。Fix-it 本是出於好意，但是它可能建議你把原本要保持不可變更的事物變成可變更的。
 
 在最後一頁的範例中，`name` 的值是否真的需要變更？只要在一開始先將常數的值設為「John」，也許就能夠更好地解決這個問題：
 */
let name = "John"
/*:
 務必記得，Xcode 會不斷嘗試給你有用的建議，但這只是建議。如果不想要花時間了解建議 Fix-it 將進行的變更，請不要接受 Fix-it。
 
[上一頁](@previous)  |  第 8 頁，共 13 頁  |  [下一頁：變化世界中較安全的程式碼](@next)
 */