/*:
## 註解
寫程式最重要的就是必須清楚好懂。程式設計師在程式碼中留了一些筆記以解釋其程式碼。這有助於之後閱讀程式碼的人可以快速理解。
這些筆記我們稱為「註解」。

註解會被 Playground 忽略，且不會影響到程式碼的運作方式。

註解以兩個斜線開頭 `//`：
 */
// This is a comment; it does not affect the code
//34 + 56 + 230
//: 因為註解會遭到忽略，在結果列中不會顯示該程式碼行的結果。
200 + 34 + 45
/*:
 - callout(實驗：): 
試試在 `34 + 56 + 230` 前加上兩條斜線以將計算式「轉成註解」(或稱「註解掉」)。\
試試看移除計算式 `200 + 34 + 45` 的兩條斜線以「取消註解」。\
編輯部分現有的表示式，然後新增幾個你自己的表示式。\
請注意每次進行變更時，側邊欄中的結果就會更新。
 */

1 + 2 + 3 + 100
/*:
 程式設計師在編寫程式時，經常將程式碼轉成註解 (註解掉) 和取消註解。但註解還有更重要的用途。編寫程式碼的同時，你也需要把它記錄下來。這樣可以幫助你記錄做出某些決定的原因，還有解釋程式碼的運作方式。你可以在別的檔案記錄這些資料，但如果這些資料就在你的程式碼當中，讀起來會容易得多。因此程式設計師使用註解來記錄他們的程式碼。
 
 舉例來說，以上的計算式代表什麼？因為有註解，程式碼讀起來很容易理解。
 */
// Total money (in dollars): Coin jar, wallet, and bank account
34 + 56 + 230

// Minutes of violin practice: Two weeks ago, last week, and this week
200 + 34 + 45
/*:
深呼吸一下，然後前往下一頁。

[上一頁](@previous)  |  第 4 頁，共 7 頁  |  [下一頁：遇到問題時 😰](@next)
 */