/*:
## 關於實例

你已經了解 Swift 中的類型，並已了解它們與現實世界中事物的類型極其相似。
 
現實世界中的每個類型都有許多實際的實體實例：

- 就「汽車」的類型來說，在路上有相當多的個別差異，每輛車都有自己的公里數、品牌、型號、顏色、油量、刮痕和凹痕。每輛車還有自己特定的一套操作方式：啟動、煞車、換擋等等。
 
 
- 就「城市」的類型來說，城市的每個實例都具有不同的名稱、人口、位置和地標。一個城市有其執行事務的特定方式，如緊急應變措施或收集垃圾方式等。
 
類型用於定義或描述特定事物類型的屬性和行為。但是，類型的每個具體範例 (每輛車、每個城市) 在該類型中都是獨立且不受彼此影響的實例。
 
想像一下，有兩輛品牌和型號相同的汽車，都在同一年生產。一輛正在高速公路上快速奔馳，而另一輛沒油停在路邊。就是兩個類型相同，但內容不同的實例。
 
或者，想想兩個城市。每個城市的位置都不同。一個城市中的地標可能吸引許多觀光客，而另一個城市中的地標卻可能因年久失修而乏人問津。同樣是城市，但各個城市卻可能彼此迥然不同。
 
在程式設計中，你可以建立和使用特定類型的不同實例。每個實例都有自己的一組屬性值，每個實例都可以執行獨立於其他實例的行為。
 
接下來，我們來看看程式碼中的一些實例。
 
第 1 頁，共 17 頁   |  [下一頁：實例](@next)
 */