/*:
## 主控台

 作為程式設計師，你必須在幕後作業，在幕後查看並進行一般使用者不會執行的操作。其中一項作業就是「主控台」。主控台的起源是因為當初唯一和電腦互動的方式是打字和查看文字。

 你或許知道主控台在電玩遊戲和電視領域所代表的意思。但在程式設計中，主控台是訊息中心，可以顯示程式執行方式的相關詳細資訊。

### 顯示主控台
 按一下 Xcode 視窗左下方的此按鈕來顯示主控台：

 ![主控台按鈕](console_button.png)

 或是 Xcode 視窗右上方中間的按鈕來顯示主控台：

 ![隱藏和顯示面板三個一組的按鈕](xcode-show-debug-area.png)

 練習顯示和隱藏主控台幾次，但練習完後將主控台保持顯示狀態。
 
 若要調整主控台的高度，請將滑鼠移至主控台頂端的工具列，直到游標變成有上下箭頭的水平工具列，接著再拖移工具列。

 ![上下調整滑鼠游標的大小](resizeUpDownCursor.png)

### 列印

 `print` 指令會告知 Swift 程式要將訊息傳送至主控台。你可以將指該令與如下字串一起使用：

 `print("Testing, one two three.")`

 - callout(練習：): 試著將下列字串列印出來。
 */


//: 前往下一頁，了解如何將字串組合在一起。

/*:
[上一頁](@previous)  |  第 5 頁，共 18 頁  |  [下一頁：組合字串](@next)
 */