/*:
## 總結

 在程式碼的範圍外，開發者必須面對現實世界中的雜亂失序。尤其是資料，經常會發現得到的跟期望中並不相同。有時資料並不完整，或需要結合其他資料源才能呈現完整的樣貌。即使資料集已經完成，有時候也必須先清理才能正常使用。清理資料可以根據資料性質採取不同形式。(而且比起手動處理，懂得如何寫程式，可以更有效地清理資料。)
 
 清理資料是轉變資料的一種方法，讓資料更適合手邊進行的工作或是更準確。除了轉變之外，你還可以把資料放在新的情境中，或是從中取得更多資訊來轉譯資料。
 
 你也學到第三方程式碼的價值，以及如何正確引用第三方程式碼。如果你以前沒有留意過，現在一定會注意到在這一頁 (和本課程所有 Playground 的最後一頁) 上的授權，跟你使用的第三方程式碼授權相同。

 _Copyright © 2021 Apple Inc._

 茲免費授權任何人均可取得本軟體及相關文件之副本 (以下稱「本軟體」)，可無限制交易本軟體 (包括但不限於使用、複製、修改、合併、發行、散佈、轉授權及 (或) 銷售本軟體之副本)，並允許接受本軟體之個人在下列條件下從事此類行為：

 本軟體之所有副本或重要部分均須載明上述版權聲明與本許可聲明。

 本軟體乃依「現況」提供，不含任何明示或默示擔保，包括但不限於適售性、符合特定目的及未侵權之瑕疵擔保。在任何情況下，對於因本軟體而起，或是與本軟體、使用本軟體或交易本軟體有關之任何索賠、損害或其他賠償責任，無論是出於合約之訴、侵權行為或其他形式的索賠，作者或著作權所有人概不負責。

[上一頁](@previous)  |  第 11 頁，共 11 頁
 */