/*:
## 類型從何而來？ 
 
 Swift 中內建有多種類型，代表所有程式的基本建構區塊。你已經花了很多時間學習 `String` 和 `Int`，還有很多其他類型可以使用。
 
 這些都是「Swift 標準資料庫」的一部分。所有程式設計語言都有相似的地方，那就是執行基本程式設計任務所需的一系列基本功能。
 
 你已經在 `String` 和 `Int` 上花了很多時間，還有很多其他類型等著你學習使用。以下是 Swift 標準資料庫中的一些其他類型。現在不用擔心它們是什麼意思，但是可以來猜一猜：

- `Array`
- `Dictionary`
- `Set`
- `Sequence`
- `Error`
- `Bool`

 請注意，所有類型名稱都是以大寫字母開頭，即使是由多個單字構成，每個單字的第一個字母也都會大寫。這與以小寫字母開頭的常數、變數和函數的命名規則不太一樣。
 
 這種區別是刻意的。類型的名稱以大寫字母開頭，這樣一來就很容易將它們與函數、變數和常數的名稱區分開來。兩種都是採用駝峰格式，不過類型使用「大駝峰格式」而非「小駝峰格式」。

 - callout(實驗：): 試想一些類型，使用大駝峰格式會長什麼樣子，例如 `TrainingShoe` 或 `RacingBike`。

 此外還有更多類型。我們將在下一頁中找出它們的來源。
 
[上一頁](@previous)  |  第 9 頁，共 13 頁  |  [下一頁：標準資料庫以外](@next)
 */