/*:
## 總結

 在此 Playground 中，你應用了所有的技能建立像素畫與動畫。你看見了此單元中許多所練習概念的實務應用，例如具有參數和結構的函數。你取得的程式設計工具愈多，愈容易用創新的方式表達你自己。隨著個人技術的出現，藝術表達的世界又多增加了一種媒體。恭喜你加入電腦藝術社群！在你繼續進行程式設計的過程中，想想看還有哪些創新的方式可應用你的技能。
 
  _Copyright © 2021 Apple Inc._

 茲免費授權任何人均可取得本軟體及相關文件之副本 (以下稱「本軟體」)，可無限制交易本軟體 (包括但不限於使用、複製、修改、合併、發行、散佈、轉授權及 (或) 銷售本軟體之副本)，並允許接受本軟體之個人在下列條件下從事此類行為：

 本軟體之所有副本或重要部分均須載明上述版權聲明與本許可聲明。

 本軟體乃依「現況」提供，不含任何明示或默示擔保，包括但不限於適售性、符合特定目的及未侵權之瑕疵擔保。在任何情況下，對於因本軟體而起，或是與本軟體、使用本軟體或交易本軟體有關之任何索賠、損害或其他賠償責任，無論是出於合約之訴、侵權行為或其他形式的索賠，作者或著作權所有人概不負責。

[上一頁](@previous)  |  第 10 頁，共 13 頁  |  [下一頁：練習：表情符號](@next)
 */