/*:
## 總結

 在此 Playground 中，你學到以三種不同形式視覺化資料的方式。圓餅圖讓你可以清楚看到每個元素與整體間的關係。長條圖讓你可以輕鬆比較資料中不同的元素。散佈圖則是非常有助於查看兩個不同變數間的關係或相關性。散佈圖通常用來呈現一個特定變數如何隨時間變化。使用視覺化圖表有助於直接對資料元素進行分類和比較，便於取得嶄新洞察和知識。在本堂課的學習過程中，你可以多加運用視覺化圖表。
  
 
  _Copyright © 2021 Apple Inc._

 茲免費授權任何人均可取得本軟體及相關文件之副本 (以下稱「本軟體」)，可無限制交易本軟體 (包括但不限於使用、複製、修改、合併、發行、散佈、轉授權及 (或) 銷售本軟體之副本)，並允許接受本軟體之個人在下列條件下從事此類行為：

 本軟體之所有副本或重要部分均須載明上述版權聲明與本許可聲明。

 本軟體乃依「現況」提供，不含任何明示或默示擔保，包括但不限於適售性、符合特定目的及未侵權之瑕疵擔保。在任何情況下，對於因本軟體而起，或是與本軟體、使用本軟體或交易本軟體有關之任何索賠、損害或其他賠償責任，無論是出於合約之訴、侵權行為或其他形式的索賠，作者或著作權所有人概不負責。

[上一頁](@previous)  |  第 11 頁，共 11 頁
 */