/*:
## Playground 是什麼？
Playground 是你可以不受干擾地實驗程式碼、並立即看到結果的地方。Playground 結合了說明事物 (像是此文字) 的部分和可變更的即時程式碼。

最容易編寫的「程式碼」就是數字：
 */
765
/*:
👆有沒有發現上面這行數字長得不太一樣？這種樣式的文字是「可編輯的程式碼」，表示你可以編寫或是改變程式碼，讓電腦依從不同指令動作。

負數使用減號：
 */
-1200
/*:
有注意到數字也會出現在右側的灰色區域中嗎？👉

那區域是「結果側邊欄」。如果你新增或變更程式碼，Playground 就會重新執行程式碼，並將結果更新至側邊欄。

 - callout(實驗：): 
   - 按一下程式碼行，並將游標移至該處。
   - 輸入並開始編輯程式碼。
   - 變更數字幾次。
   - 新增幾個數字，一行分別新增一個。

 請注意每次進行變更時，側邊欄中的結果就會更新。

接下來，我們來了解如何善用結果側邊欄。
 
[上一頁](@previous)  |  第 2 頁，共 7 頁  |  [下一頁：計算](@next)
 */