/*:
## 寵物問題
想像一下你的朋友要舉辦一場寵物展，需要記錄寵物展中出現的每種動物的數量。你的朋友也需要知道寵物展中的動物總數和哺乳類動物的數量。

假設你手邊只有一台有安裝 Xcode 的筆記型電腦。或許你可以使用 Playground 來協助你的朋友。

運用目前所知，你可以善用註解和數字來記錄每種動物的數量，如下所示：
 */
// Number Of Dogs
5

// Number Of Cats
4

// Number Of Turtles
3

//: 然後將這些數目複製到新的程式碼行，並讓 Playground 替你進行計算，如下所示：
// Total Number Of Animals
5 + 4 + 3

// Total Number Of Mammals
5 + 4
/*:
 - callout(實驗：): 隨著一週過去，你得到越來越多關於會參加的寵物資訊。\
變更上方的程式碼以更新總數。

例如，如果另一個人要帶一隻狗，則將 `Number Of Dogs` 從 `5` 變更為 `6`，並將其他地方出現的 `5` 變更為 `6` (`Total Number Of Animals` 和 `Total Number Of Mammals`)。

如果有人帶來新品種的動物，則和其他動物數量的計算一樣使用相同的模式。在某一行新增註解 (例如，`// Number Of Hamsters`)，並在下一行輸入數字。別忘記更新總數。

- 另一人帶了一隻狗。
- 其中一隻烏龜生病了不能來。
- 另一人帶了一隻貓。
- 有人帶了一隻倉鼠 (哺乳動物)。

 有更好的方式能夠解決此問題嗎？稍微想一下再繼續。

[上一頁](@previous)  |  第 2 頁，共 14 頁  |  [下一頁：寵物問題回顧](@next)
 */