/*:
## 練習：任意圖形動畫

 此頁保留空白，讓你能夠建立你自己的動畫。請隨意探索可能性：

- 在迴圈中設定並清除個別的像素，以建立簡單的迷你動畫。
- 使用在此頁面上已建構的子畫面函數 (來自先前頁面的人員與微笑元件)，讓子畫面呈現動畫效果。
- 嘗試使用 `if` 語句在不同的迴圈反覆中繪製不同的事物。
- 使用像素陣列來繪製形狀、你的簽名，或任何其他使用一條線的事物。使用迴圈以一次一個像素的方式繪製線條。
 
 在此頁面上，你可以使用 `displaySize` 變數在四個顯示解析度之間選擇。其值預設為 .fortyByForty。務必「先」設定 `displaySize`，再設定任何的程式碼。
 */
displaySize = .fortyByForty
/*:
  _Copyright © 2021 Apple Inc._

 茲免費授權任何人均可取得本軟體及相關文件之副本 (以下稱「本軟體」)，可無限制交易本軟體 (包括但不限於使用、複製、修改、合併、發行、散佈、轉授權及 (或) 銷售本軟體之副本)，並允許接受本軟體之個人在下列條件下從事此類行為：

 本軟體之所有副本或重要部分均須載明上述版權聲明與本許可聲明。

 本軟體乃依「現況」提供，不含任何明示或默示擔保，包括但不限於適售性、符合特定目的及未侵權之瑕疵擔保。在任何情況下，對於因本軟體而起，或是與本軟體、使用本軟體或交易本軟體有關之任何索賠、損害或其他賠償責任，無論是出於合約之訴、侵權行為或其他形式的索賠，作者或著作權所有人概不負責。

[上一頁](@previous)  |  第 13 頁，共 13 頁
 */